GROUP_TO_PROMO_NAME = {
    "GEO-G1": "10 скидка",
    "GEO-G2": "9 скидка",
    "GEO-G3": "8 скидка",
    "GEO-G4": "7 скидка",
    "GEO-G5": "6 скидка",
    "GEO-G6": "5 скидка",
    "GEO-G7": "4 скидка",
    "GEO-G8": "2 скидка",
    "GEO-G9": "1 скидка",
    "GEO-G10": "3 ОБЩАЯ скидка",
}

GROUP_TO_SKUS = {
    "GEO-G1": [],
    "GEO-G2": ["1623103356"],
    "GEO-G3": ["2093202384"],
    "GEO-G4": ["1623463208"],
    "GEO-G5": ["1623130393"],
    "GEO-G6": ["1623122283", "1623390586"],
    "GEO-G7": ["1126807106"],
    "GEO-G8": ["1126270148", "1126287877"],
    "GEO-G9": ["1623121210", "2093193904"],
    "GEO-G10": [],
}
