# app/config.py
"""
Конфигурация соответствия акций их SKU и ID.
Можно редактировать вручную, без пересборки Railway.
"""

ACTIONS = {
    "10 скидка": {
        "id": 2983461,
        "skus": ["1126245121"],
    },
    "9 скидка": {
        "id": 2983456,
        "skus": ["1623103356"],
    },
    "8 скидка": {
        "id": 2983449,
        "skus": ["2093202384", "2093193904"],
    },
    "7 скидка": {
        "id": 2983433,
        "skus": ["1623463208"],
    },
    "6 скидка": {
        "id": 2983414,
        "skus": ["1623130393"],
    },
    "5 скидка": {
        "id": 2983408,
        "skus": ["1623122283", "1623390586"],
    },
    "4 скидка": {
        "id": 2983396,
        "skus": ["1126807106"],
    },
    "2 скидка": {
        "id": 2983375,
        "skus": ["1126270148", "1126287877"],
    },
    "1 скидка": {
        "id": 2983366,
        "skus": ["1623121210"],
    },
    #"3 ОБЩАЯ скидка": {
    #    "id": 2772472,
    #    "skus": [],
    #},
}
